rtsbd/scenario7/remarkhotelRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rts="http://www.rts.co.kr/">
   <soapenv:Header>
      <rts:BaseInfo>
         <!--Optional:-->
         <rts:SiteCode>CTM1X-00</rts:SiteCode>
         <!--Optional:-->
         <rts:Password>test1234</rts:Password>
         <!--Optional:-->
         <rts:RequestType>NetPartner</rts:RequestType>
      </rts:BaseInfo>
   </soapenv:Header>
   <soapenv:Body>
      <rts:GetRemarkHotelInformationForCustomerCount>
        <rts:HotelSearchListNetGuestCount>
            <!--Optional:-->
            <rts:LanguageCode>AR</rts:LanguageCode>
            <!--Optional:-->
            <rts:TravelerNationality>AR</rts:TravelerNationality>
            <!--Optional:-->
            <rts:CityCode>MOW</rts:CityCode>
            <!--Optional:-->
            <rts:CheckInDate>2020-04-18</rts:CheckInDate>
            <!--Optional:-->
            <rts:CheckOutDate>2020-04-21</rts:CheckOutDate>
            <!--Optional:-->
            <rts:StarRating>0</rts:StarRating>
            <!--Optional:-->
            <rts:LocationCode></rts:LocationCode>
            <!--Optional:-->
            <rts:SupplierCompCode></rts:SupplierCompCode>
            <rts:AvailableHotelOnly>true</rts:AvailableHotelOnly>
            <rts:RecommendHotelOnly>false</rts:RecommendHotelOnly>
            <!--Optional:-->
            <rts:ClientCurrencyCode>USD</rts:ClientCurrencyCode>
            <!--Optional:-->
            <rts:ItemName></rts:ItemName>
            <!--Optional:-->
            <rts:SellerMarkup>*1</rts:SellerMarkup>
            <rts:CompareYn>false</rts:CompareYn>
            <!--Optional:-->
            <rts:SortType></rts:SortType>
            <!--Optional:-->
            <rts:ItemCodeList>
               <!--Zero or more repetitions:-->
               <rts:ItemCodeInfo>
                  <!--Optional:-->
                  <rts:ItemCode>MOW0007</rts:ItemCode>
                  <rts:ItemNo>19</rts:ItemNo>
               </rts:ItemCodeInfo>
            </rts:ItemCodeList>
            <!--Optional:-->
            <rts:GuestList>
               <!--Zero or more repetitions:-->
               <rts:GuestsInfo>
                  <rts:AdultCount>1</rts:AdultCount>
                  <rts:ChildCount>0</rts:ChildCount>
                  <rts:RoomCount>1</rts:RoomCount>
                  <rts:ChildAge1>0</rts:ChildAge1>
                  <rts:ChildAge2>0</rts:ChildAge2>
               </rts:GuestsInfo>
               <rts:GuestsInfo>
                  <rts:AdultCount>1</rts:AdultCount>
                  <rts:ChildCount>1</rts:ChildCount>
                  <rts:RoomCount>1</rts:RoomCount>
                  <rts:ChildAge1>6</rts:ChildAge1>
                  <rts:ChildAge2>0</rts:ChildAge2>
               </rts:GuestsInfo>			   
            </rts:GuestList>
         </rts:HotelSearchListNetGuestCount>
         <!--Optional:-->
         <rts:RoomTypeCode>5f576ffe-a19b-4548-a43e-6c66f1ffbb87|01001|Superior Double|RB|ADDZRDQ|BED10#6|E|20200417|Superior Double|BED01*1^BED10*1|N|HBHGRGMPKGFHPZ|~American buffet breakfast at hotel</rts:RoomTypeCode>
      </rts:GetRemarkHotelInformationForCustomerCount>
   </soapenv:Body>
</soapenv:Envelope>